{"class_name": "Model", "config": {"name": "conditional_encoder", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_38"}, "name": "input_38", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_100", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_100", "inbound_nodes": [[["input_38", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_101", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_101", "inbound_nodes": [[["conv2d_100", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_102", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_102", "inbound_nodes": [[["conv2d_101", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_103", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_103", "inbound_nodes": [[["conv2d_102", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_25", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_25", "inbound_nodes": [[["conv2d_103", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_87", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_87", "inbound_nodes": [[["flatten_25", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_88", "trainable": true, "dtype": "float32", "units": 1024, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_88", "inbound_nodes": [[["dense_87", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_89", "trainable": true, "dtype": "float32", "units": 1024, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_89", "inbound_nodes": [[["dense_87", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_25", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABAAAAAQAAABDAAAAczAAAAB8AFwCfQF9AnQAagF0AGoCfAGDAWQBjQF9A3wBdABq\nA3wCZAIbAIMBfAMUABcAUwApA04pAdoFc2hhcGXpAgAAACkE2gFL2g1yYW5kb21fbm9ybWFscgEA\nAADaA2V4cCkE2gRhcmdz2gZ6X21lYW7aCXpfbG9nX3ZhctoHZXBzaWxvbqkAcgoAAAD6IDxpcHl0\naG9uLWlucHV0LTIyNy05MDdkOWE4YmI3ZjI+2gZzYW1wbGUBAAAAcwYAAAAAAQgBEgE=\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [1024], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_25", "inbound_nodes": [[["dense_88", 0, 0, {}], ["dense_89", 0, 0, {}]]]}], "input_layers": [["input_38", 0, 0]], "output_layers": [["lambda_25", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}